{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "uer/roberta-base-chinese-extractive-qa",
  "bias": "none",
  "eva_config": null,
  "exclude_modules": null,
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layer_replication": null,
  "layers_pattern": null,
  "layers_to_transform": null,
  "loftq_config": {},
  "lora_alpha": 512,
  "lora_bias": false,
  "lora_dropout": 0.1,
  "megatron_config": null,
  "megatron_core": "megatron.core",
  "modules_to_save": [
    "qa_outputs"
  ],
  "peft_type": "LORA",
  "r": 256,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "value",
    "query"
  ],
  "task_type": "QUESTION_ANS",
  "use_dora": false,
  "use_rslora": false
}